Revit 2024 API
TabbedDialogExtension Members
The TabbedDialogExtension type exposes the following members.
Constructors
Name | Description
TabbedDialogExtension
Constructs a extension instance with a control and ok action handler.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetContextualHelp
Gets the contextual help.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Control
The control.
OnCancelAction
The cancel handler.
OnOKAction
The ok handler.
OnRestoreDefaultsAction
The restore defaults handler.
See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace